/*
Необходимо создать систему управления библиотекой с использованием классов. 
Используйте все знания, которые вы приобрели о классах, 
в том числе про приватные/публичные методы и поля.

Описание задания:
Ваша задача — реализовать две основные сущности: Библиотека и Книга. 
В рамках этого задания вам нужно создать классы, которые позволят управлять книгами 
в библиотеке. 
Библиотека должна иметь возможность добавлять новые книги, получать информацию 
о книгах по различным параметрам, 
удалять книги и выводить список всех книг.
*/

